{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 16], "dtype": "float32", "input_dim": 14482, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 16}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_1/kernel", "shape": [100, 1], "dtype": "float32", "quantization": {"min": -2.5086352404426124, "scale": 0.01900481242759555, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.12579406797885895, "scale": 1.0, "dtype": "uint8"}}, {"name": "embedding_1/embeddings", "shape": [14482, 32], "dtype": "float32", "quantization": {"min": -2.018167126412485, "scale": 0.015405855926812864, "dtype": "uint8"}}, {"name": "lstm_1/kernel", "shape": [32, 400], "dtype": "float32", "quantization": {"min": -2.780097686543184, "scale": 0.022787685955272002, "dtype": "uint8"}}, {"name": "lstm_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32", "quantization": {"min": -2.039536823945887, "scale": 0.016186800190046723, "dtype": "uint8"}}, {"name": "lstm_1/bias", "shape": [400], "dtype": "float32", "quantization": {"min": -0.785897502712175, "scale": 0.00785897502712175, "dtype": "uint8"}}]}]}